feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Mask for Ifx_CCU6_CC62R_Bits.CCV */
#define IFX_CCU6_CC62R_CCV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_CC62R_Bits.CCV */
#define IFX_CCU6_CC62R_CCV_OFF (0u)

/** \brief  Length for Ifx_CCU6_CC62SR_Bits.CCS */
#define IFX_CCU6_CC62SR_CCS_LEN (16u)

/** \brief  Mask for Ifx_CCU6_CC62SR_Bits.CCS */
#define IFX_CCU6_CC62SR_CCS_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_CC62SR_Bits.CCS */
#define IFX_CCU6_CC62SR_CCS_OFF (0u)

/** \brief  Length for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_LEN (16u)

/** \brief  Mask for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_CC63R_Bits.CCV */
#define IFX_CCU6_CC63R_CCV_OFF (0u)

/** \brief  Length for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_LEN (16u)

/** \brief  Mask for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_CC63SR_Bits.CCS */
#define IFX_CCU6_CC63SR_CCS_OFF (0u)

/** \brief  Length for Ifx_CCU6_CLC_Bits.DISR */
#define IFX_CCU6_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CLC_Bits.DISR */
#define IFX_CCU6_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CLC_Bits.DISR */
#define IFX_CCU6_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_CCU6_CLC_Bits.DISS */
#define IFX_CCU6_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CLC_Bits.DISS */
#define IFX_CCU6_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CLC_Bits.DISS */
#define IFX_CCU6_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_CCU6_CLC_Bits.EDIS */
#define IFX_CCU6_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CLC_Bits.EDIS */
#define IFX_CCU6_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CLC_Bits.EDIS */
#define IFX_CCU6_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC60R */
#define IFX_CCU6_CMPMODIF_MCC60R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC60R */
#define IFX_CCU6_CMPMODIF_MCC60R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC60R */
#define IFX_CCU6_CMPMODIF_MCC60R_OFF (8u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC60S */
#define IFX_CCU6_CMPMODIF_MCC60S_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC60S */
#define IFX_CCU6_CMPMODIF_MCC60S_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC60S */
#define IFX_CCU6_CMPMODIF_MCC60S_OFF (0u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC61R */
#define IFX_CCU6_CMPMODIF_MCC61R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC61R */
#define IFX_CCU6_CMPMODIF_MCC61R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC61R */
#define IFX_CCU6_CMPMODIF_MCC61R_OFF (9u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC61S */
#define IFX_CCU6_CMPMODIF_MCC61S_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC61S */
#define IFX_CCU6_CMPMODIF_MCC61S_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC61S */
#define IFX_CCU6_CMPMODIF_MCC61S_OFF (1u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC62R */
#define IFX_CCU6_CMPMODIF_MCC62R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC62R */
#define IFX_CCU6_CMPMODIF_MCC62R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC62R */
#define IFX_CCU6_CMPMODIF_MCC62R_OFF (10u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC62S */
#define IFX_CCU6_CMPMODIF_MCC62S_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC62S */
#define IFX_CCU6_CMPMODIF_MCC62S_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC62S */
#define IFX_CCU6_CMPMODIF_MCC62S_OFF (2u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC63R */
#define IFX_CCU6_CMPMODIF_MCC63R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC63R */
#define IFX_CCU6_CMPMODIF_MCC63R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC63R */
#define IFX_CCU6_CMPMODIF_MCC63R_OFF (14u)

/** \brief  Length for Ifx_CCU6_CMPMODIF_Bits.MCC63S */
#define IFX_CCU6_CMPMODIF_MCC63S_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPMODIF_Bits.MCC63S */
#define IFX_CCU6_CMPMODIF_MCC63S_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPMODIF_Bits.MCC63S */
#define IFX_CCU6_CMPMODIF_MCC63S_OFF (6u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC60PS */
#define IFX_CCU6_CMPSTAT_CC60PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC60PS */
#define IFX_CCU6_CMPSTAT_CC60PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC60PS */
#define IFX_CCU6_CMPSTAT_CC60PS_OFF (8u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC60ST */
#define IFX_CCU6_CMPSTAT_CC60ST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC60ST */
#define IFX_CCU6_CMPSTAT_CC60ST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC60ST */
#define IFX_CCU6_CMPSTAT_CC60ST_OFF (0u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC61PS */
#define IFX_CCU6_CMPSTAT_CC61PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC61PS */
#define IFX_CCU6_CMPSTAT_CC61PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC61PS */
#define IFX_CCU6_CMPSTAT_CC61PS_OFF (10u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC61ST */
#define IFX_CCU6_CMPSTAT_CC61ST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC61ST */
#define IFX_CCU6_CMPSTAT_CC61ST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC61ST */
#define IFX_CCU6_CMPSTAT_CC61ST_OFF (1u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC62PS */
#define IFX_CCU6_CMPSTAT_CC62PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC62PS */
#define IFX_CCU6_CMPSTAT_CC62PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC62PS */
#define IFX_CCU6_CMPSTAT_CC62PS_OFF (12u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC62ST */
#define IFX_CCU6_CMPSTAT_CC62ST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC62ST */
#define IFX_CCU6_CMPSTAT_CC62ST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC62ST */
#define IFX_CCU6_CMPSTAT_CC62ST_OFF (2u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CC63ST */
#define IFX_CCU6_CMPSTAT_CC63ST_OFF (6u)

