feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS60 */
#define IFX_CCU6_CMPSTAT_CCPOS60_OFF (3u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS61 */
#define IFX_CCU6_CMPSTAT_CCPOS61_OFF (4u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.CCPOS62 */
#define IFX_CCU6_CMPSTAT_CCPOS62_OFF (5u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.COUT60PS */
#define IFX_CCU6_CMPSTAT_COUT60PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.COUT60PS */
#define IFX_CCU6_CMPSTAT_COUT60PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.COUT60PS */
#define IFX_CCU6_CMPSTAT_COUT60PS_OFF (9u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.COUT61PS */
#define IFX_CCU6_CMPSTAT_COUT61PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.COUT61PS */
#define IFX_CCU6_CMPSTAT_COUT61PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.COUT61PS */
#define IFX_CCU6_CMPSTAT_COUT61PS_OFF (11u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.COUT62PS */
#define IFX_CCU6_CMPSTAT_COUT62PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.COUT62PS */
#define IFX_CCU6_CMPSTAT_COUT62PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.COUT62PS */
#define IFX_CCU6_CMPSTAT_COUT62PS_OFF (13u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.COUT63PS */
#define IFX_CCU6_CMPSTAT_COUT63PS_OFF (14u)

/** \brief  Length for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_CMPSTAT_Bits.T13IM */
#define IFX_CCU6_CMPSTAT_T13IM_OFF (15u)

/** \brief  Length for Ifx_CCU6_ID_Bits.MODNUMBER */
#define IFX_CCU6_ID_MODNUMBER_LEN (8u)

/** \brief  Mask for Ifx_CCU6_ID_Bits.MODNUMBER */
#define IFX_CCU6_ID_MODNUMBER_MSK (0xffu)

/** \brief  Offset for Ifx_CCU6_ID_Bits.MODNUMBER */
#define IFX_CCU6_ID_MODNUMBER_OFF (8u)

/** \brief  Length for Ifx_CCU6_ID_Bits.MODREV */
#define IFX_CCU6_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_CCU6_ID_Bits.MODREV */
#define IFX_CCU6_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_CCU6_ID_Bits.MODREV */
#define IFX_CCU6_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC60F */
#define IFX_CCU6_IEN_ENCC60F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC60F */
#define IFX_CCU6_IEN_ENCC60F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC60F */
#define IFX_CCU6_IEN_ENCC60F_OFF (1u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC60R */
#define IFX_CCU6_IEN_ENCC60R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC60R */
#define IFX_CCU6_IEN_ENCC60R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC60R */
#define IFX_CCU6_IEN_ENCC60R_OFF (0u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC61F */
#define IFX_CCU6_IEN_ENCC61F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC61F */
#define IFX_CCU6_IEN_ENCC61F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC61F */
#define IFX_CCU6_IEN_ENCC61F_OFF (3u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC61R */
#define IFX_CCU6_IEN_ENCC61R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC61R */
#define IFX_CCU6_IEN_ENCC61R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC61R */
#define IFX_CCU6_IEN_ENCC61R_OFF (2u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC62F */
#define IFX_CCU6_IEN_ENCC62F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC62F */
#define IFX_CCU6_IEN_ENCC62F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC62F */
#define IFX_CCU6_IEN_ENCC62F_OFF (5u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCC62R */
#define IFX_CCU6_IEN_ENCC62R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCC62R */
#define IFX_CCU6_IEN_ENCC62R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCC62R */
#define IFX_CCU6_IEN_ENCC62R_OFF (4u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_OFF (12u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_OFF (14u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_OFF (15u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENT12OM */
#define IFX_CCU6_IEN_ENT12OM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENT12OM */
#define IFX_CCU6_IEN_ENT12OM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENT12OM */
#define IFX_CCU6_IEN_ENT12OM_OFF (6u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_OFF (7u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_OFF (8u)

