feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Length for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_OFF (9u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_OFF (10u)

/** \brief  Length for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_OFF (13u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CC60INI */
#define IFX_CCU6_IMON_CC60INI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CC60INI */
#define IFX_CCU6_IMON_CC60INI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CC60INI */
#define IFX_CCU6_IMON_CC60INI_OFF (4u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CC61INI */
#define IFX_CCU6_IMON_CC61INI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CC61INI */
#define IFX_CCU6_IMON_CC61INI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CC61INI */
#define IFX_CCU6_IMON_CC61INI_OFF (5u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CC62INI */
#define IFX_CCU6_IMON_CC62INI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CC62INI */
#define IFX_CCU6_IMON_CC62INI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CC62INI */
#define IFX_CCU6_IMON_CC62INI_OFF (6u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CCPOS0I */
#define IFX_CCU6_IMON_CCPOS0I_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CCPOS0I */
#define IFX_CCU6_IMON_CCPOS0I_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CCPOS0I */
#define IFX_CCU6_IMON_CCPOS0I_OFF (1u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CCPOS1I */
#define IFX_CCU6_IMON_CCPOS1I_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CCPOS1I */
#define IFX_CCU6_IMON_CCPOS1I_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CCPOS1I */
#define IFX_CCU6_IMON_CCPOS1I_OFF (2u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CCPOS2I */
#define IFX_CCU6_IMON_CCPOS2I_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CCPOS2I */
#define IFX_CCU6_IMON_CCPOS2I_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CCPOS2I */
#define IFX_CCU6_IMON_CCPOS2I_OFF (3u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.CTRAPI */
#define IFX_CCU6_IMON_CTRAPI_OFF (7u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.LBE */
#define IFX_CCU6_IMON_LBE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.LBE */
#define IFX_CCU6_IMON_LBE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.LBE */
#define IFX_CCU6_IMON_LBE_OFF (0u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.T12HRI */
#define IFX_CCU6_IMON_T12HRI_OFF (8u)

/** \brief  Length for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IMON_Bits.T13HRI */
#define IFX_CCU6_IMON_T13HRI_OFF (9u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPCC60 */
#define IFX_CCU6_INP_INPCC60_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPCC60 */
#define IFX_CCU6_INP_INPCC60_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPCC60 */
#define IFX_CCU6_INP_INPCC60_OFF (0u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPCC61 */
#define IFX_CCU6_INP_INPCC61_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPCC61 */
#define IFX_CCU6_INP_INPCC61_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPCC61 */
#define IFX_CCU6_INP_INPCC61_OFF (2u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPCC62 */
#define IFX_CCU6_INP_INPCC62_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPCC62 */
#define IFX_CCU6_INP_INPCC62_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPCC62 */
#define IFX_CCU6_INP_INPCC62_OFF (4u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPCHE */
#define IFX_CCU6_INP_INPCHE_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPCHE */
#define IFX_CCU6_INP_INPCHE_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPCHE */
#define IFX_CCU6_INP_INPCHE_OFF (6u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPERR */
#define IFX_CCU6_INP_INPERR_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPERR */
#define IFX_CCU6_INP_INPERR_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPERR */
#define IFX_CCU6_INP_INPERR_OFF (8u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPT12 */
#define IFX_CCU6_INP_INPT12_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPT12 */
#define IFX_CCU6_INP_INPT12_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPT12 */
#define IFX_CCU6_INP_INPT12_OFF (10u)

/** \brief  Length for Ifx_CCU6_INP_Bits.INPT13 */
#define IFX_CCU6_INP_INPT13_LEN (2u)

/** \brief  Mask for Ifx_CCU6_INP_Bits.INPT13 */
#define IFX_CCU6_INP_INPT13_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_INP_Bits.INPT13 */
#define IFX_CCU6_INP_INPT13_OFF (12u)

/** \brief  Length for Ifx_CCU6_IS_Bits.CHE */
#define IFX_CCU6_IS_CHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.CHE */
#define IFX_CCU6_IS_CHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.CHE */
#define IFX_CCU6_IS_CHE_OFF (12u)

/** \brief  Length for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC60F */
#define IFX_CCU6_IS_ICC60F_OFF (1u)

/** \brief  Length for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC60R */
#define IFX_CCU6_IS_ICC60R_OFF (0u)

