feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Length for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC61F */
#define IFX_CCU6_IS_ICC61F_OFF (3u)

/** \brief  Length for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC61R */
#define IFX_CCU6_IS_ICC61R_OFF (2u)

/** \brief  Length for Ifx_CCU6_IS_Bits.ICC62F */
#define IFX_CCU6_IS_ICC62F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC62F */
#define IFX_CCU6_IS_ICC62F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC62F */
#define IFX_CCU6_IS_ICC62F_OFF (5u)

/** \brief  Length for Ifx_CCU6_IS_Bits.ICC62R */
#define IFX_CCU6_IS_ICC62R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.ICC62R */
#define IFX_CCU6_IS_ICC62R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.ICC62R */
#define IFX_CCU6_IS_ICC62R_OFF (4u)

/** \brief  Length for Ifx_CCU6_IS_Bits.IDLE */
#define IFX_CCU6_IS_IDLE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.IDLE */
#define IFX_CCU6_IS_IDLE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.IDLE */
#define IFX_CCU6_IS_IDLE_OFF (14u)

/** \brief  Length for Ifx_CCU6_IS_Bits.STR */
#define IFX_CCU6_IS_STR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.STR */
#define IFX_CCU6_IS_STR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.STR */
#define IFX_CCU6_IS_STR_OFF (15u)

/** \brief  Length for Ifx_CCU6_IS_Bits.T12OM */
#define IFX_CCU6_IS_T12OM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.T12OM */
#define IFX_CCU6_IS_T12OM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.T12OM */
#define IFX_CCU6_IS_T12OM_OFF (6u)

/** \brief  Length for Ifx_CCU6_IS_Bits.T12PM */
#define IFX_CCU6_IS_T12PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.T12PM */
#define IFX_CCU6_IS_T12PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.T12PM */
#define IFX_CCU6_IS_T12PM_OFF (7u)

/** \brief  Length for Ifx_CCU6_IS_Bits.T13CM */
#define IFX_CCU6_IS_T13CM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.T13CM */
#define IFX_CCU6_IS_T13CM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.T13CM */
#define IFX_CCU6_IS_T13CM_OFF (8u)

/** \brief  Length for Ifx_CCU6_IS_Bits.T13PM */
#define IFX_CCU6_IS_T13PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.T13PM */
#define IFX_CCU6_IS_T13PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.T13PM */
#define IFX_CCU6_IS_T13PM_OFF (9u)

/** \brief  Length for Ifx_CCU6_IS_Bits.TRPF */
#define IFX_CCU6_IS_TRPF_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.TRPF */
#define IFX_CCU6_IS_TRPF_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.TRPF */
#define IFX_CCU6_IS_TRPF_OFF (10u)

/** \brief  Length for Ifx_CCU6_IS_Bits.TRPS */
#define IFX_CCU6_IS_TRPS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.TRPS */
#define IFX_CCU6_IS_TRPS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.TRPS */
#define IFX_CCU6_IS_TRPS_OFF (11u)

/** \brief  Length for Ifx_CCU6_IS_Bits.WHE */
#define IFX_CCU6_IS_WHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_IS_Bits.WHE */
#define IFX_CCU6_IS_WHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_IS_Bits.WHE */
#define IFX_CCU6_IS_WHE_OFF (13u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC60F */
#define IFX_CCU6_ISR_RCC60F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC60F */
#define IFX_CCU6_ISR_RCC60F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC60F */
#define IFX_CCU6_ISR_RCC60F_OFF (1u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC60R */
#define IFX_CCU6_ISR_RCC60R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC60R */
#define IFX_CCU6_ISR_RCC60R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC60R */
#define IFX_CCU6_ISR_RCC60R_OFF (0u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC61F */
#define IFX_CCU6_ISR_RCC61F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC61F */
#define IFX_CCU6_ISR_RCC61F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC61F */
#define IFX_CCU6_ISR_RCC61F_OFF (3u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC61R */
#define IFX_CCU6_ISR_RCC61R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC61R */
#define IFX_CCU6_ISR_RCC61R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC61R */
#define IFX_CCU6_ISR_RCC61R_OFF (2u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC62F */
#define IFX_CCU6_ISR_RCC62F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC62F */
#define IFX_CCU6_ISR_RCC62F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC62F */
#define IFX_CCU6_ISR_RCC62F_OFF (5u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCC62R */
#define IFX_CCU6_ISR_RCC62R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCC62R */
#define IFX_CCU6_ISR_RCC62R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCC62R */
#define IFX_CCU6_ISR_RCC62R_OFF (4u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RCHE */
#define IFX_CCU6_ISR_RCHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RCHE */
#define IFX_CCU6_ISR_RCHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RCHE */
#define IFX_CCU6_ISR_RCHE_OFF (12u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RIDLE */
#define IFX_CCU6_ISR_RIDLE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RIDLE */
#define IFX_CCU6_ISR_RIDLE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RIDLE */
#define IFX_CCU6_ISR_RIDLE_OFF (14u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RSTR */
#define IFX_CCU6_ISR_RSTR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RSTR */
#define IFX_CCU6_ISR_RSTR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RSTR */
#define IFX_CCU6_ISR_RSTR_OFF (15u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RT12OM */
#define IFX_CCU6_ISR_RT12OM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RT12OM */
#define IFX_CCU6_ISR_RT12OM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RT12OM */
#define IFX_CCU6_ISR_RT12OM_OFF (6u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RT12PM */
#define IFX_CCU6_ISR_RT12PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RT12PM */
#define IFX_CCU6_ISR_RT12PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RT12PM */
#define IFX_CCU6_ISR_RT12PM_OFF (7u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RT13CM */
#define IFX_CCU6_ISR_RT13CM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RT13CM */
#define IFX_CCU6_ISR_RT13CM_MSK (0x1u)

