feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Offset for Ifx_CCU6_ISR_Bits.RT13CM */
#define IFX_CCU6_ISR_RT13CM_OFF (8u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RT13PM */
#define IFX_CCU6_ISR_RT13PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RT13PM */
#define IFX_CCU6_ISR_RT13PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RT13PM */
#define IFX_CCU6_ISR_RT13PM_OFF (9u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RTRPF */
#define IFX_CCU6_ISR_RTRPF_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RTRPF */
#define IFX_CCU6_ISR_RTRPF_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RTRPF */
#define IFX_CCU6_ISR_RTRPF_OFF (10u)

/** \brief  Length for Ifx_CCU6_ISR_Bits.RWHE */
#define IFX_CCU6_ISR_RWHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISR_Bits.RWHE */
#define IFX_CCU6_ISR_RWHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISR_Bits.RWHE */
#define IFX_CCU6_ISR_RWHE_OFF (13u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC60F */
#define IFX_CCU6_ISS_SCC60F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC60F */
#define IFX_CCU6_ISS_SCC60F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC60F */
#define IFX_CCU6_ISS_SCC60F_OFF (1u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC60R */
#define IFX_CCU6_ISS_SCC60R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC60R */
#define IFX_CCU6_ISS_SCC60R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC60R */
#define IFX_CCU6_ISS_SCC60R_OFF (0u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC61F */
#define IFX_CCU6_ISS_SCC61F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC61F */
#define IFX_CCU6_ISS_SCC61F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC61F */
#define IFX_CCU6_ISS_SCC61F_OFF (3u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC61R */
#define IFX_CCU6_ISS_SCC61R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC61R */
#define IFX_CCU6_ISS_SCC61R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC61R */
#define IFX_CCU6_ISS_SCC61R_OFF (2u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC62F */
#define IFX_CCU6_ISS_SCC62F_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC62F */
#define IFX_CCU6_ISS_SCC62F_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC62F */
#define IFX_CCU6_ISS_SCC62F_OFF (5u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCC62R */
#define IFX_CCU6_ISS_SCC62R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCC62R */
#define IFX_CCU6_ISS_SCC62R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCC62R */
#define IFX_CCU6_ISS_SCC62R_OFF (4u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SCHE */
#define IFX_CCU6_ISS_SCHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SCHE */
#define IFX_CCU6_ISS_SCHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SCHE */
#define IFX_CCU6_ISS_SCHE_OFF (12u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SIDLE */
#define IFX_CCU6_ISS_SIDLE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SIDLE */
#define IFX_CCU6_ISS_SIDLE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SIDLE */
#define IFX_CCU6_ISS_SIDLE_OFF (14u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SSTR */
#define IFX_CCU6_ISS_SSTR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SSTR */
#define IFX_CCU6_ISS_SSTR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SSTR */
#define IFX_CCU6_ISS_SSTR_OFF (15u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.ST12OM */
#define IFX_CCU6_ISS_ST12OM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.ST12OM */
#define IFX_CCU6_ISS_ST12OM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.ST12OM */
#define IFX_CCU6_ISS_ST12OM_OFF (6u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.ST12PM */
#define IFX_CCU6_ISS_ST12PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.ST12PM */
#define IFX_CCU6_ISS_ST12PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.ST12PM */
#define IFX_CCU6_ISS_ST12PM_OFF (7u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.ST13CM */
#define IFX_CCU6_ISS_ST13CM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.ST13CM */
#define IFX_CCU6_ISS_ST13CM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.ST13CM */
#define IFX_CCU6_ISS_ST13CM_OFF (8u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.ST13PM */
#define IFX_CCU6_ISS_ST13PM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.ST13PM */
#define IFX_CCU6_ISS_ST13PM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.ST13PM */
#define IFX_CCU6_ISS_ST13PM_OFF (9u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.STRPF */
#define IFX_CCU6_ISS_STRPF_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.STRPF */
#define IFX_CCU6_ISS_STRPF_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.STRPF */
#define IFX_CCU6_ISS_STRPF_OFF (10u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SWHC */
#define IFX_CCU6_ISS_SWHC_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SWHC */
#define IFX_CCU6_ISS_SWHC_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SWHC */
#define IFX_CCU6_ISS_SWHC_OFF (11u)

/** \brief  Length for Ifx_CCU6_ISS_Bits.SWHE */
#define IFX_CCU6_ISS_SWHE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_ISS_Bits.SWHE */
#define IFX_CCU6_ISS_SWHE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_ISS_Bits.SWHE */
#define IFX_CCU6_ISS_SWHE_OFF (13u)

/** \brief  Length for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_CCU6_KSCSR_Bits.SB0 */
#define IFX_CCU6_KSCSR_SB0_LEN (1u)

