feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Mask for Ifx_CCU6_KSCSR_Bits.SB0 */
#define IFX_CCU6_KSCSR_SB0_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KSCSR_Bits.SB0 */
#define IFX_CCU6_KSCSR_SB0_OFF (0u)

/** \brief  Length for Ifx_CCU6_KSCSR_Bits.SB1 */
#define IFX_CCU6_KSCSR_SB1_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KSCSR_Bits.SB1 */
#define IFX_CCU6_KSCSR_SB1_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KSCSR_Bits.SB1 */
#define IFX_CCU6_KSCSR_SB1_OFF (1u)

/** \brief  Length for Ifx_CCU6_KSCSR_Bits.SB2 */
#define IFX_CCU6_KSCSR_SB2_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KSCSR_Bits.SB2 */
#define IFX_CCU6_KSCSR_SB2_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KSCSR_Bits.SB2 */
#define IFX_CCU6_KSCSR_SB2_OFF (2u)

/** \brief  Length for Ifx_CCU6_KSCSR_Bits.SB3 */
#define IFX_CCU6_KSCSR_SB3_LEN (1u)

/** \brief  Mask for Ifx_CCU6_KSCSR_Bits.SB3 */
#define IFX_CCU6_KSCSR_SB3_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_KSCSR_Bits.SB3 */
#define IFX_CCU6_KSCSR_SB3_OFF (3u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CC60INEN */
#define IFX_CCU6_LI_CC60INEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CC60INEN */
#define IFX_CCU6_LI_CC60INEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CC60INEN */
#define IFX_CCU6_LI_CC60INEN_OFF (4u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CC61INEN */
#define IFX_CCU6_LI_CC61INEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CC61INEN */
#define IFX_CCU6_LI_CC61INEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CC61INEN */
#define IFX_CCU6_LI_CC61INEN_OFF (5u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CC62INEN */
#define IFX_CCU6_LI_CC62INEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CC62INEN */
#define IFX_CCU6_LI_CC62INEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CC62INEN */
#define IFX_CCU6_LI_CC62INEN_OFF (6u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CCPOS0EN */
#define IFX_CCU6_LI_CCPOS0EN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CCPOS0EN */
#define IFX_CCU6_LI_CCPOS0EN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CCPOS0EN */
#define IFX_CCU6_LI_CCPOS0EN_OFF (1u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CCPOS1EN */
#define IFX_CCU6_LI_CCPOS1EN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CCPOS1EN */
#define IFX_CCU6_LI_CCPOS1EN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CCPOS1EN */
#define IFX_CCU6_LI_CCPOS1EN_OFF (2u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CCPOS2EN */
#define IFX_CCU6_LI_CCPOS2EN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CCPOS2EN */
#define IFX_CCU6_LI_CCPOS2EN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CCPOS2EN */
#define IFX_CCU6_LI_CCPOS2EN_OFF (3u)

/** \brief  Length for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.CTRAPEN */
#define IFX_CCU6_LI_CTRAPEN_OFF (7u)

/** \brief  Length for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_LEN (2u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.INPLBE */
#define IFX_CCU6_LI_INPLBE_OFF (14u)

/** \brief  Length for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.LBEEN */
#define IFX_CCU6_LI_LBEEN_OFF (13u)

/** \brief  Length for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.T12HREN */
#define IFX_CCU6_LI_T12HREN_OFF (8u)

/** \brief  Length for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_LI_Bits.T13HREN */
#define IFX_CCU6_LI_T13HREN_OFF (9u)

/** \brief  Length for Ifx_CCU6_MCFG_Bits.MCM */
#define IFX_CCU6_MCFG_MCM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCFG_Bits.MCM */
#define IFX_CCU6_MCFG_MCM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCFG_Bits.MCM */
#define IFX_CCU6_MCFG_MCM_OFF (2u)

/** \brief  Length for Ifx_CCU6_MCFG_Bits.T12 */
#define IFX_CCU6_MCFG_T12_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCFG_Bits.T12 */
#define IFX_CCU6_MCFG_T12_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCFG_Bits.T12 */
#define IFX_CCU6_MCFG_T12_OFF (0u)

/** \brief  Length for Ifx_CCU6_MCFG_Bits.T13 */
#define IFX_CCU6_MCFG_T13_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCFG_Bits.T13 */
#define IFX_CCU6_MCFG_T13_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCFG_Bits.T13 */
#define IFX_CCU6_MCFG_T13_OFF (1u)

/** \brief  Length for Ifx_CCU6_MCMCTR_Bits.STE12D */
#define IFX_CCU6_MCMCTR_STE12D_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMCTR_Bits.STE12D */
#define IFX_CCU6_MCMCTR_STE12D_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMCTR_Bits.STE12D */
#define IFX_CCU6_MCMCTR_STE12D_OFF (9u)

/** \brief  Length for Ifx_CCU6_MCMCTR_Bits.STE12U */
#define IFX_CCU6_MCMCTR_STE12U_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMCTR_Bits.STE12U */
#define IFX_CCU6_MCMCTR_STE12U_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMCTR_Bits.STE12U */
#define IFX_CCU6_MCMCTR_STE12U_OFF (8u)

/** \brief  Length for Ifx_CCU6_MCMCTR_Bits.STE13U */
#define IFX_CCU6_MCMCTR_STE13U_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMCTR_Bits.STE13U */
#define IFX_CCU6_MCMCTR_STE13U_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMCTR_Bits.STE13U */
#define IFX_CCU6_MCMCTR_STE13U_OFF (10u)

/** \brief  Length for Ifx_CCU6_MCMCTR_Bits.SWSEL */
#define IFX_CCU6_MCMCTR_SWSEL_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MCMCTR_Bits.SWSEL */
#define IFX_CCU6_MCMCTR_SWSEL_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MCMCTR_Bits.SWSEL */
#define IFX_CCU6_MCMCTR_SWSEL_OFF (0u)

/** \brief  Length for Ifx_CCU6_MCMCTR_Bits.SWSYN */
#define IFX_CCU6_MCMCTR_SWSYN_LEN (2u)

/** \brief  Mask for Ifx_CCU6_MCMCTR_Bits.SWSYN */
#define IFX_CCU6_MCMCTR_SWSYN_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_MCMCTR_Bits.SWSYN */
#define IFX_CCU6_MCMCTR_SWSYN_OFF (4u)

/** \brief  Length for Ifx_CCU6_MCMOUT_Bits.CURH */
#define IFX_CCU6_MCMOUT_CURH_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MCMOUT_Bits.CURH */
#define IFX_CCU6_MCMOUT_CURH_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MCMOUT_Bits.CURH */
#define IFX_CCU6_MCMOUT_CURH_OFF (11u)

/** \brief  Length for Ifx_CCU6_MCMOUT_Bits.EXPH */
#define IFX_CCU6_MCMOUT_EXPH_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MCMOUT_Bits.EXPH */
#define IFX_CCU6_MCMOUT_EXPH_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MCMOUT_Bits.EXPH */
#define IFX_CCU6_MCMOUT_EXPH_OFF (8u)

/** \brief  Length for Ifx_CCU6_MCMOUT_Bits.MCMP */
#define IFX_CCU6_MCMOUT_MCMP_LEN (6u)

/** \brief  Mask for Ifx_CCU6_MCMOUT_Bits.MCMP */
#define IFX_CCU6_MCMOUT_MCMP_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_MCMOUT_Bits.MCMP */
#define IFX_CCU6_MCMOUT_MCMP_OFF (0u)

