feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Length for Ifx_CCU6_MCMOUT_Bits.R */
#define IFX_CCU6_MCMOUT_R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMOUT_Bits.R */
#define IFX_CCU6_MCMOUT_R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMOUT_Bits.R */
#define IFX_CCU6_MCMOUT_R_OFF (6u)

/** \brief  Length for Ifx_CCU6_MCMOUTS_Bits.CURHS */
#define IFX_CCU6_MCMOUTS_CURHS_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MCMOUTS_Bits.CURHS */
#define IFX_CCU6_MCMOUTS_CURHS_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MCMOUTS_Bits.CURHS */
#define IFX_CCU6_MCMOUTS_CURHS_OFF (11u)

/** \brief  Length for Ifx_CCU6_MCMOUTS_Bits.EXPHS */
#define IFX_CCU6_MCMOUTS_EXPHS_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MCMOUTS_Bits.EXPHS */
#define IFX_CCU6_MCMOUTS_EXPHS_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MCMOUTS_Bits.EXPHS */
#define IFX_CCU6_MCMOUTS_EXPHS_OFF (8u)

/** \brief  Length for Ifx_CCU6_MCMOUTS_Bits.MCMPS */
#define IFX_CCU6_MCMOUTS_MCMPS_LEN (6u)

/** \brief  Mask for Ifx_CCU6_MCMOUTS_Bits.MCMPS */
#define IFX_CCU6_MCMOUTS_MCMPS_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_MCMOUTS_Bits.MCMPS */
#define IFX_CCU6_MCMOUTS_MCMPS_OFF (0u)

/** \brief  Length for Ifx_CCU6_MCMOUTS_Bits.STRHP */
#define IFX_CCU6_MCMOUTS_STRHP_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMOUTS_Bits.STRHP */
#define IFX_CCU6_MCMOUTS_STRHP_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMOUTS_Bits.STRHP */
#define IFX_CCU6_MCMOUTS_STRHP_OFF (15u)

/** \brief  Length for Ifx_CCU6_MCMOUTS_Bits.STRMCM */
#define IFX_CCU6_MCMOUTS_STRMCM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MCMOUTS_Bits.STRMCM */
#define IFX_CCU6_MCMOUTS_STRMCM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MCMOUTS_Bits.STRMCM */
#define IFX_CCU6_MCMOUTS_STRMCM_OFF (7u)

/** \brief  Length for Ifx_CCU6_MODCTR_Bits.ECT13O */
#define IFX_CCU6_MODCTR_ECT13O_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MODCTR_Bits.ECT13O */
#define IFX_CCU6_MODCTR_ECT13O_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MODCTR_Bits.ECT13O */
#define IFX_CCU6_MODCTR_ECT13O_OFF (15u)

/** \brief  Length for Ifx_CCU6_MODCTR_Bits.MCMEN */
#define IFX_CCU6_MODCTR_MCMEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_MODCTR_Bits.MCMEN */
#define IFX_CCU6_MODCTR_MCMEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_MODCTR_Bits.MCMEN */
#define IFX_CCU6_MODCTR_MCMEN_OFF (7u)

/** \brief  Length for Ifx_CCU6_MODCTR_Bits.T12MODEN */
#define IFX_CCU6_MODCTR_T12MODEN_LEN (6u)

/** \brief  Mask for Ifx_CCU6_MODCTR_Bits.T12MODEN */
#define IFX_CCU6_MODCTR_T12MODEN_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_MODCTR_Bits.T12MODEN */
#define IFX_CCU6_MODCTR_T12MODEN_OFF (0u)

/** \brief  Length for Ifx_CCU6_MODCTR_Bits.T13MODEN */
#define IFX_CCU6_MODCTR_T13MODEN_LEN (6u)

/** \brief  Mask for Ifx_CCU6_MODCTR_Bits.T13MODEN */
#define IFX_CCU6_MODCTR_T13MODEN_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_MODCTR_Bits.T13MODEN */
#define IFX_CCU6_MODCTR_T13MODEN_OFF (8u)

/** \brief  Length for Ifx_CCU6_MOSEL_Bits.TRIG0SEL */
#define IFX_CCU6_MOSEL_TRIG0SEL_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MOSEL_Bits.TRIG0SEL */
#define IFX_CCU6_MOSEL_TRIG0SEL_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MOSEL_Bits.TRIG0SEL */
#define IFX_CCU6_MOSEL_TRIG0SEL_OFF (0u)

/** \brief  Length for Ifx_CCU6_MOSEL_Bits.TRIG1SEL */
#define IFX_CCU6_MOSEL_TRIG1SEL_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MOSEL_Bits.TRIG1SEL */
#define IFX_CCU6_MOSEL_TRIG1SEL_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MOSEL_Bits.TRIG1SEL */
#define IFX_CCU6_MOSEL_TRIG1SEL_OFF (3u)

/** \brief  Length for Ifx_CCU6_MOSEL_Bits.TRIG2SEL */
#define IFX_CCU6_MOSEL_TRIG2SEL_LEN (3u)

/** \brief  Mask for Ifx_CCU6_MOSEL_Bits.TRIG2SEL */
#define IFX_CCU6_MOSEL_TRIG2SEL_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_MOSEL_Bits.TRIG2SEL */
#define IFX_CCU6_MOSEL_TRIG2SEL_OFF (6u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_LEN (2u)

/** \brief  Mask for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_OFF (0u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISCC60 */
#define IFX_CCU6_PISEL0_ISCC60_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISCC60 */
#define IFX_CCU6_PISEL0_ISCC60_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISCC60 */
#define IFX_CCU6_PISEL0_ISCC60_OFF (0u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISCC61 */
#define IFX_CCU6_PISEL0_ISCC61_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISCC61 */
#define IFX_CCU6_PISEL0_ISCC61_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISCC61 */
#define IFX_CCU6_PISEL0_ISCC61_OFF (2u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISCC62 */
#define IFX_CCU6_PISEL0_ISCC62_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISCC62 */
#define IFX_CCU6_PISEL0_ISCC62_MSK (0x3u)

