feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISCC62 */
#define IFX_CCU6_PISEL0_ISCC62_OFF (4u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISPOS0 */
#define IFX_CCU6_PISEL0_ISPOS0_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISPOS0 */
#define IFX_CCU6_PISEL0_ISPOS0_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISPOS0 */
#define IFX_CCU6_PISEL0_ISPOS0_OFF (8u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISPOS1 */
#define IFX_CCU6_PISEL0_ISPOS1_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISPOS1 */
#define IFX_CCU6_PISEL0_ISPOS1_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISPOS1 */
#define IFX_CCU6_PISEL0_ISPOS1_OFF (10u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISPOS2 */
#define IFX_CCU6_PISEL0_ISPOS2_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISPOS2 */
#define IFX_CCU6_PISEL0_ISPOS2_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISPOS2 */
#define IFX_CCU6_PISEL0_ISPOS2_OFF (12u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.IST12HR */
#define IFX_CCU6_PISEL0_IST12HR_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.IST12HR */
#define IFX_CCU6_PISEL0_IST12HR_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.IST12HR */
#define IFX_CCU6_PISEL0_IST12HR_OFF (14u)

/** \brief  Length for Ifx_CCU6_PISEL0_Bits.ISTRP */
#define IFX_CCU6_PISEL0_ISTRP_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL0_Bits.ISTRP */
#define IFX_CCU6_PISEL0_ISTRP_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL0_Bits.ISTRP */
#define IFX_CCU6_PISEL0_ISTRP_OFF (6u)

/** \brief  Length for Ifx_CCU6_PISEL2_Bits.ISCNT12 */
#define IFX_CCU6_PISEL2_ISCNT12_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL2_Bits.ISCNT12 */
#define IFX_CCU6_PISEL2_ISCNT12_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL2_Bits.ISCNT12 */
#define IFX_CCU6_PISEL2_ISCNT12_OFF (2u)

/** \brief  Length for Ifx_CCU6_PISEL2_Bits.ISCNT13 */
#define IFX_CCU6_PISEL2_ISCNT13_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL2_Bits.ISCNT13 */
#define IFX_CCU6_PISEL2_ISCNT13_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL2_Bits.ISCNT13 */
#define IFX_CCU6_PISEL2_ISCNT13_OFF (4u)

/** \brief  Length for Ifx_CCU6_PISEL2_Bits.IST13HR */
#define IFX_CCU6_PISEL2_IST13HR_LEN (2u)

/** \brief  Mask for Ifx_CCU6_PISEL2_Bits.IST13HR */
#define IFX_CCU6_PISEL2_IST13HR_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_PISEL2_Bits.IST13HR */
#define IFX_CCU6_PISEL2_IST13HR_OFF (0u)

/** \brief  Length for Ifx_CCU6_PISEL2_Bits.T12EXT */
#define IFX_CCU6_PISEL2_T12EXT_LEN (1u)

/** \brief  Mask for Ifx_CCU6_PISEL2_Bits.T12EXT */
#define IFX_CCU6_PISEL2_T12EXT_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_PISEL2_Bits.T12EXT */
#define IFX_CCU6_PISEL2_T12EXT_OFF (6u)

/** \brief  Length for Ifx_CCU6_PISEL2_Bits.T13EXT */
#define IFX_CCU6_PISEL2_T13EXT_LEN (1u)

/** \brief  Mask for Ifx_CCU6_PISEL2_Bits.T13EXT */
#define IFX_CCU6_PISEL2_T13EXT_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_PISEL2_Bits.T13EXT */
#define IFX_CCU6_PISEL2_T13EXT_OFF (7u)

/** \brief  Length for Ifx_CCU6_PSLR_Bits.PSL63 */
#define IFX_CCU6_PSLR_PSL63_LEN (1u)

/** \brief  Mask for Ifx_CCU6_PSLR_Bits.PSL63 */
#define IFX_CCU6_PSLR_PSL63_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_PSLR_Bits.PSL63 */
#define IFX_CCU6_PSLR_PSL63_OFF (7u)

/** \brief  Length for Ifx_CCU6_PSLR_Bits.PSL */
#define IFX_CCU6_PSLR_PSL_LEN (6u)

/** \brief  Mask for Ifx_CCU6_PSLR_Bits.PSL */
#define IFX_CCU6_PSLR_PSL_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_PSLR_Bits.PSL */
#define IFX_CCU6_PSLR_PSL_OFF (0u)

/** \brief  Length for Ifx_CCU6_T12_Bits.T12CV */
#define IFX_CCU6_T12_T12CV_LEN (16u)

/** \brief  Mask for Ifx_CCU6_T12_Bits.T12CV */
#define IFX_CCU6_T12_T12CV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_T12_Bits.T12CV */
#define IFX_CCU6_T12_T12CV_OFF (0u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTE0 */
#define IFX_CCU6_T12DTC_DTE0_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTE0 */
#define IFX_CCU6_T12DTC_DTE0_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTE0 */
#define IFX_CCU6_T12DTC_DTE0_OFF (8u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTE1 */
#define IFX_CCU6_T12DTC_DTE1_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTE1 */
#define IFX_CCU6_T12DTC_DTE1_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTE1 */
#define IFX_CCU6_T12DTC_DTE1_OFF (9u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTE2 */
#define IFX_CCU6_T12DTC_DTE2_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTE2 */
#define IFX_CCU6_T12DTC_DTE2_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTE2 */
#define IFX_CCU6_T12DTC_DTE2_OFF (10u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTM */
#define IFX_CCU6_T12DTC_DTM_LEN (8u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTM */
#define IFX_CCU6_T12DTC_DTM_MSK (0xffu)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTM */
#define IFX_CCU6_T12DTC_DTM_OFF (0u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTR0 */
#define IFX_CCU6_T12DTC_DTR0_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTR0 */
#define IFX_CCU6_T12DTC_DTR0_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTR0 */
#define IFX_CCU6_T12DTC_DTR0_OFF (12u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTR1 */
#define IFX_CCU6_T12DTC_DTR1_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTR1 */
#define IFX_CCU6_T12DTC_DTR1_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTR1 */
#define IFX_CCU6_T12DTC_DTR1_OFF (13u)

/** \brief  Length for Ifx_CCU6_T12DTC_Bits.DTR2 */
#define IFX_CCU6_T12DTC_DTR2_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12DTC_Bits.DTR2 */
#define IFX_CCU6_T12DTC_DTR2_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12DTC_Bits.DTR2 */
#define IFX_CCU6_T12DTC_DTR2_OFF (14u)

/** \brief  Length for Ifx_CCU6_T12MSEL_Bits.DBYP */
#define IFX_CCU6_T12MSEL_DBYP_LEN (1u)

/** \brief  Mask for Ifx_CCU6_T12MSEL_Bits.DBYP */
#define IFX_CCU6_T12MSEL_DBYP_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_T12MSEL_Bits.DBYP */
#define IFX_CCU6_T12MSEL_DBYP_OFF (15u)

/** \brief  Length for Ifx_CCU6_T12MSEL_Bits.HSYNC */
#define IFX_CCU6_T12MSEL_HSYNC_LEN (3u)

/** \brief  Mask for Ifx_CCU6_T12MSEL_Bits.HSYNC */
#define IFX_CCU6_T12MSEL_HSYNC_MSK (0x7u)

