feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Offset for Ifx_CCU6_T12MSEL_Bits.HSYNC */
#define IFX_CCU6_T12MSEL_HSYNC_OFF (12u)

/** \brief  Length for Ifx_CCU6_T12MSEL_Bits.MSEL60 */
#define IFX_CCU6_T12MSEL_MSEL60_LEN (4u)

/** \brief  Mask for Ifx_CCU6_T12MSEL_Bits.MSEL60 */
#define IFX_CCU6_T12MSEL_MSEL60_MSK (0xfu)

/** \brief  Offset for Ifx_CCU6_T12MSEL_Bits.MSEL60 */
#define IFX_CCU6_T12MSEL_MSEL60_OFF (0u)

/** \brief  Length for Ifx_CCU6_T12MSEL_Bits.MSEL61 */
#define IFX_CCU6_T12MSEL_MSEL61_LEN (4u)

/** \brief  Mask for Ifx_CCU6_T12MSEL_Bits.MSEL61 */
#define IFX_CCU6_T12MSEL_MSEL61_MSK (0xfu)

/** \brief  Offset for Ifx_CCU6_T12MSEL_Bits.MSEL61 */
#define IFX_CCU6_T12MSEL_MSEL61_OFF (4u)

/** \brief  Length for Ifx_CCU6_T12MSEL_Bits.MSEL62 */
#define IFX_CCU6_T12MSEL_MSEL62_LEN (4u)

/** \brief  Mask for Ifx_CCU6_T12MSEL_Bits.MSEL62 */
#define IFX_CCU6_T12MSEL_MSEL62_MSK (0xfu)

/** \brief  Offset for Ifx_CCU6_T12MSEL_Bits.MSEL62 */
#define IFX_CCU6_T12MSEL_MSEL62_OFF (8u)

/** \brief  Length for Ifx_CCU6_T12PR_Bits.T12PV */
#define IFX_CCU6_T12PR_T12PV_LEN (16u)

/** \brief  Mask for Ifx_CCU6_T12PR_Bits.T12PV */
#define IFX_CCU6_T12PR_T12PV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_T12PR_Bits.T12PV */
#define IFX_CCU6_T12PR_T12PV_OFF (0u)

/** \brief  Length for Ifx_CCU6_T13_Bits.T13CV */
#define IFX_CCU6_T13_T13CV_LEN (16u)

/** \brief  Mask for Ifx_CCU6_T13_Bits.T13CV */
#define IFX_CCU6_T13_T13CV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_T13_Bits.T13CV */
#define IFX_CCU6_T13_T13CV_OFF (0u)

/** \brief  Length for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_LEN (16u)

/** \brief  Mask for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_MSK (0xffffu)

/** \brief  Offset for Ifx_CCU6_T13PR_Bits.T13PV */
#define IFX_CCU6_T13PR_T13PV_OFF (0u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.CDIR */
#define IFX_CCU6_TCTR0_CDIR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.CDIR */
#define IFX_CCU6_TCTR0_CDIR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.CDIR */
#define IFX_CCU6_TCTR0_CDIR_OFF (6u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.CTM */
#define IFX_CCU6_TCTR0_CTM_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.CTM */
#define IFX_CCU6_TCTR0_CTM_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.CTM */
#define IFX_CCU6_TCTR0_CTM_OFF (7u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.STE12 */
#define IFX_CCU6_TCTR0_STE12_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.STE12 */
#define IFX_CCU6_TCTR0_STE12_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.STE12 */
#define IFX_CCU6_TCTR0_STE12_OFF (5u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.STE13 */
#define IFX_CCU6_TCTR0_STE13_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.STE13 */
#define IFX_CCU6_TCTR0_STE13_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.STE13 */
#define IFX_CCU6_TCTR0_STE13_OFF (13u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T12CLK */
#define IFX_CCU6_TCTR0_T12CLK_LEN (3u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T12CLK */
#define IFX_CCU6_TCTR0_T12CLK_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T12CLK */
#define IFX_CCU6_TCTR0_T12CLK_OFF (0u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T12PRE */
#define IFX_CCU6_TCTR0_T12PRE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T12PRE */
#define IFX_CCU6_TCTR0_T12PRE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T12PRE */
#define IFX_CCU6_TCTR0_T12PRE_OFF (3u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T12R */
#define IFX_CCU6_TCTR0_T12R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T12R */
#define IFX_CCU6_TCTR0_T12R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T12R */
#define IFX_CCU6_TCTR0_T12R_OFF (4u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T13CLK */
#define IFX_CCU6_TCTR0_T13CLK_LEN (3u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T13CLK */
#define IFX_CCU6_TCTR0_T13CLK_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T13CLK */
#define IFX_CCU6_TCTR0_T13CLK_OFF (8u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T13PRE */
#define IFX_CCU6_TCTR0_T13PRE_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T13PRE */
#define IFX_CCU6_TCTR0_T13PRE_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T13PRE */
#define IFX_CCU6_TCTR0_T13PRE_OFF (11u)

/** \brief  Length for Ifx_CCU6_TCTR0_Bits.T13R */
#define IFX_CCU6_TCTR0_T13R_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR0_Bits.T13R */
#define IFX_CCU6_TCTR0_T13R_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR0_Bits.T13R */
#define IFX_CCU6_TCTR0_T13R_OFF (12u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T12RSEL */
#define IFX_CCU6_TCTR2_T12RSEL_LEN (2u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T12RSEL */
#define IFX_CCU6_TCTR2_T12RSEL_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T12RSEL */
#define IFX_CCU6_TCTR2_T12RSEL_OFF (8u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T12SSC */
#define IFX_CCU6_TCTR2_T12SSC_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T12SSC */
#define IFX_CCU6_TCTR2_T12SSC_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T12SSC */
#define IFX_CCU6_TCTR2_T12SSC_OFF (0u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T13RSEL */
#define IFX_CCU6_TCTR2_T13RSEL_LEN (2u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T13RSEL */
#define IFX_CCU6_TCTR2_T13RSEL_MSK (0x3u)

/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T13RSEL */
#define IFX_CCU6_TCTR2_T13RSEL_OFF (10u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T13SSC */
#define IFX_CCU6_TCTR2_T13SSC_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T13SSC */
#define IFX_CCU6_TCTR2_T13SSC_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T13SSC */
#define IFX_CCU6_TCTR2_T13SSC_OFF (1u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T13TEC */
#define IFX_CCU6_TCTR2_T13TEC_LEN (3u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T13TEC */
#define IFX_CCU6_TCTR2_T13TEC_MSK (0x7u)

/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T13TEC */
#define IFX_CCU6_TCTR2_T13TEC_OFF (2u)

/** \brief  Length for Ifx_CCU6_TCTR2_Bits.T13TED */
#define IFX_CCU6_TCTR2_T13TED_LEN (2u)

/** \brief  Mask for Ifx_CCU6_TCTR2_Bits.T13TED */
#define IFX_CCU6_TCTR2_T13TED_MSK (0x3u)

