feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxCcu6_bf.h
/** \brief  Offset for Ifx_CCU6_TCTR2_Bits.T13TED */
#define IFX_CCU6_TCTR2_T13TED_OFF (5u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.DTRES */
#define IFX_CCU6_TCTR4_DTRES_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.DTRES */
#define IFX_CCU6_TCTR4_DTRES_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.DTRES */
#define IFX_CCU6_TCTR4_DTRES_OFF (3u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12CNT */
#define IFX_CCU6_TCTR4_T12CNT_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12CNT */
#define IFX_CCU6_TCTR4_T12CNT_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12CNT */
#define IFX_CCU6_TCTR4_T12CNT_OFF (5u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12RES */
#define IFX_CCU6_TCTR4_T12RES_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12RES */
#define IFX_CCU6_TCTR4_T12RES_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12RES */
#define IFX_CCU6_TCTR4_T12RES_OFF (2u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12RR */
#define IFX_CCU6_TCTR4_T12RR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12RR */
#define IFX_CCU6_TCTR4_T12RR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12RR */
#define IFX_CCU6_TCTR4_T12RR_OFF (0u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12RS */
#define IFX_CCU6_TCTR4_T12RS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12RS */
#define IFX_CCU6_TCTR4_T12RS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12RS */
#define IFX_CCU6_TCTR4_T12RS_OFF (1u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12STD */
#define IFX_CCU6_TCTR4_T12STD_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12STD */
#define IFX_CCU6_TCTR4_T12STD_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12STD */
#define IFX_CCU6_TCTR4_T12STD_OFF (7u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T12STR */
#define IFX_CCU6_TCTR4_T12STR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T12STR */
#define IFX_CCU6_TCTR4_T12STR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T12STR */
#define IFX_CCU6_TCTR4_T12STR_OFF (6u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13CNT */
#define IFX_CCU6_TCTR4_T13CNT_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13CNT */
#define IFX_CCU6_TCTR4_T13CNT_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13CNT */
#define IFX_CCU6_TCTR4_T13CNT_OFF (13u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13RES */
#define IFX_CCU6_TCTR4_T13RES_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13RES */
#define IFX_CCU6_TCTR4_T13RES_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13RES */
#define IFX_CCU6_TCTR4_T13RES_OFF (10u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13RR */
#define IFX_CCU6_TCTR4_T13RR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13RR */
#define IFX_CCU6_TCTR4_T13RR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13RR */
#define IFX_CCU6_TCTR4_T13RR_OFF (8u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13RS */
#define IFX_CCU6_TCTR4_T13RS_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13RS */
#define IFX_CCU6_TCTR4_T13RS_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13RS */
#define IFX_CCU6_TCTR4_T13RS_OFF (9u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13STD */
#define IFX_CCU6_TCTR4_T13STD_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13STD */
#define IFX_CCU6_TCTR4_T13STD_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13STD */
#define IFX_CCU6_TCTR4_T13STD_OFF (15u)

/** \brief  Length for Ifx_CCU6_TCTR4_Bits.T13STR */
#define IFX_CCU6_TCTR4_T13STR_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TCTR4_Bits.T13STR */
#define IFX_CCU6_TCTR4_T13STR_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TCTR4_Bits.T13STR */
#define IFX_CCU6_TCTR4_T13STR_OFF (14u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPEN13 */
#define IFX_CCU6_TRPCTR_TRPEN13_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPEN13 */
#define IFX_CCU6_TRPCTR_TRPEN13_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPEN13 */
#define IFX_CCU6_TRPCTR_TRPEN13_OFF (14u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPEN */
#define IFX_CCU6_TRPCTR_TRPEN_LEN (6u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPEN */
#define IFX_CCU6_TRPCTR_TRPEN_MSK (0x3fu)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPEN */
#define IFX_CCU6_TRPCTR_TRPEN_OFF (8u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPM0 */
#define IFX_CCU6_TRPCTR_TRPM0_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPM0 */
#define IFX_CCU6_TRPCTR_TRPM0_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPM0 */
#define IFX_CCU6_TRPCTR_TRPM0_OFF (0u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPM1 */
#define IFX_CCU6_TRPCTR_TRPM1_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPM1 */
#define IFX_CCU6_TRPCTR_TRPM1_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPM1 */
#define IFX_CCU6_TRPCTR_TRPM1_OFF (1u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPM2 */
#define IFX_CCU6_TRPCTR_TRPM2_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPM2 */
#define IFX_CCU6_TRPCTR_TRPM2_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPM2 */
#define IFX_CCU6_TRPCTR_TRPM2_OFF (2u)

/** \brief  Length for Ifx_CCU6_TRPCTR_Bits.TRPPEN */
#define IFX_CCU6_TRPCTR_TRPPEN_LEN (1u)

/** \brief  Mask for Ifx_CCU6_TRPCTR_Bits.TRPPEN */
#define IFX_CCU6_TRPCTR_TRPPEN_MSK (0x1u)

/** \brief  Offset for Ifx_CCU6_TRPCTR_Bits.TRPPEN */
#define IFX_CCU6_TRPCTR_TRPPEN_OFF (15u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCCU6_BF_H */
